main/Catalogs/Инфекции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<Catalog>
		<Properties>
			<Name>Инфекции</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВходитВНациональныйКалендарь</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаличиеВГруппеРиска</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыИнфекцияПоВхождениюВГруппыРиска</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Вакцины</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Вакцина</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Вакцины</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>МесяцаВакцинаций</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Месяц</Name>
							<Comment>Возраст указывается как КоличествоМесяцев.КоличествоНедель</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>1</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеВозраста</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>МесяцаВакцинацийДляЛицИзГруппРиска</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Месяц</Name>
							<Comment>Возраст указывается как КоличествоМесяцев.КоличествоНедель</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>1</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеВозраста</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

main/Enums/ТипыИнфекцияПоВхождениюВГруппыРиска.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<Enum>
		<Properties>
			<Name>ТипыИнфекцияПоВхождениюВГруппыРиска</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВходитВГруппуРиска</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеВходитВГруппуРиска</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧастичноВходитВГруппуРиска</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

main/Catalogs/Инфекции/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

Функция СформироватьДанныеИнфекций() Экспорт
	
	// Возраст указывается как КоличествоМесяцев.КоличествоНедель
	// Пример 4 - это четыре месяца
	// Пример 4.2 - это четыре с половиной месяца (4 месяца и 2 недели)
	// Пример 4.5 - это пять месяцев и одна неделя (4 месяца и 5 недель)
	
	СписокИнфекций = Новый Соответствие;
	
	#Область ВирусныйГепатитВ
	
	ДанныеИнфекции = ПолучитьСтруктуруДанныхИнфекций();
	ДанныеИнфекции.ВходитВНациональныйКалендарь = Истина;
	ДанныеИнфекции.НаличиеВГруппеРиска = Перечисления.ТипыИнфекцияПоВхождениюВГруппыРиска.ЧастичноВходитВГруппуРиска;
	
	ДанныеИнфекции.МесяцаВакцинаций.Добавить(0);
	ДанныеИнфекции.МесяцаВакцинаций.Добавить(1);
	ДанныеИнфекции.МесяцаВакцинаций.Добавить(6);
	
	ДанныеИнфекции.МесяцаВакцинацийДляЛицИзГруппРиска.Добавить(0);
	ДанныеИнфекции.МесяцаВакцинацийДляЛицИзГруппРиска.Добавить(1);
	ДанныеИнфекции.МесяцаВакцинацийДляЛицИзГруппРиска.Добавить(2);
	ДанныеИнфекции.МесяцаВакцинацийДляЛицИзГруппРиска.Добавить(12);
	
	ДанныеИнфекции.Вакцины.Добавить(Справочники.Вакцины.РегевакВ);
	ДанныеИнфекции.Вакцины.Добавить(Справочники.Вакцины.ИнфанриксГекса);
	
	СписокИнфекций.Вставить(Справочники.Инфекции.ВирусныйГепатитВ, ДанныеИнфекции);
	
	#КонецОбласти
	
	#Область ГемофильнаяИнфекция
	
	ДанныеИнфекции = ПолучитьСтруктуруДанныхИнфекций();
	ДанныеИнфекции.ВходитВНациональныйКалендарь = Истина;
	ДанныеИнфекции.НаличиеВГруппеРиска = Перечисления.ТипыИнфекцияПоВхождениюВГруппыРиска.ВходитВГруппуРиска;
	
	ДанныеИнфекции.МесяцаВакцинацийДляЛицИзГруппРиска.Добавить(3);
	ДанныеИнфекции.МесяцаВакцинацийДляЛицИзГруппРиска.Добавить(4.2);
	ДанныеИнфекции.МесяцаВакцинацийДляЛицИзГруппРиска.Добавить(6);
	ДанныеИнфекции.МесяцаВакцинацийДляЛицИзГруппРиска.Добавить(18);
	
	ДанныеИнфекции.Вакцины.Добавить(Справочники.Вакцины.ИнфанриксГекса);
	ДанныеИнфекции.Вакцины.Добавить(Справочники.Вакцины.Пентаксим);
	ДанныеИнфекции.Вакцины.Добавить(Справочники.Вакцины.АктХИБ);
	ДанныеИнфекции.Вакцины.Добавить(Справочники.Вакцины.Хиберикс);
	
	СписокИнфекций.Вставить(Справочники.Инфекции.ГемофильнаяИнфекция, ДанныеИнфекции);
	
	#КонецОбласти
	
	#Область Грипп
	
	ДанныеИнфекции = ПолучитьСтруктуруДанныхИнфекций();
	
	ДанныеИнфекции.МесяцаВакцинаций.Добавить(6);
	ДанныеИнфекции.МесяцаВакцинаций.Добавить(12);
	ДанныеИнфекции.МесяцаВакцинаций.Добавить(24);
	ДанныеИнфекции.МесяцаВакцинаций.Добавить(36);
	ДанныеИнфекции.МесяцаВакцинаций.Добавить(48);
	ДанныеИнфекции.МесяцаВакцинаций.Добавить(60);
	ДанныеИнфекции.МесяцаВакцинаций.Добавить(72);
	ДанныеИнфекции.МесяцаВакцинаций.Добавить(84);
	ДанныеИнфекции.МесяцаВакцинаций.Добавить(96);
	ДанныеИнфекции.МесяцаВакцинаций.Добавить(108);
	ДанныеИнфекции.МесяцаВакцинаций.Добавить(120);
	ДанныеИнфекции.МесяцаВакцинаций.Добавить(132);
	ДанныеИнфекции.МесяцаВакцинаций.Добавить(144);
	ДанныеИнфекции.МесяцаВакцинаций.Добавить(156);
	ДанныеИнфекции.МесяцаВакцинаций.Добавить(168);
	ДанныеИнфекции.МесяцаВакцинаций.Добавить(180);
	ДанныеИнфекции.МесяцаВакцинаций.Добавить(192);
	ДанныеИнфекции.МесяцаВакцинаций.Добавить(204);
	
	ДанныеИнфекции.Вакцины.Добавить(Справочники.Вакцины.Ваксигрип);
	ДанныеИнфекции.Вакцины.Добавить(Справочники.Вакцины.ГрипполПлюс);
	ДанныеИнфекции.Вакцины.Добавить(Справочники.Вакцины.Ультрикс);
	ДанныеИнфекции.Вакцины.Добавить(Справочники.Вакцины.Флюарикс);
	
	СписокИнфекций.Вставить(Справочники.Инфекции.Грипп, ДанныеИнфекции);
	
	#КонецОбласти
	
	#Область Дифтерия
	
	ДанныеИнфекции = ПолучитьСтруктуруДанныхИнфекций();
	ДанныеИнфекции.ВходитВНациональныйКалендарь = Истина;
	
	ДанныеИнфекции.МесяцаВакцинаций.Добавить(3);
	ДанныеИнфекции.МесяцаВакцинаций.Добавить(4.2);
	ДанныеИнфекции.МесяцаВакцинаций.Добавить(6);
	ДанныеИнфекции.МесяцаВакцинаций.Добавить(18);
	ДанныеИнфекции.МесяцаВакцинаций.Добавить(72);
	ДанныеИнфекции.МесяцаВакцинаций.Добавить(168);
	
	ДанныеИнфекции.Вакцины.Добавить(Справочники.Вакцины.ИнфанриксГекса);
	ДанныеИнфекции.Вакцины.Добавить(Справочники.Вакцины.Пентаксим);
	
	СписокИнфекций.Вставить(Справочники.Инфекции.Дифтерия, ДанныеИнфекции);
	
	#КонецОбласти
	
	#Область Коклюш
	
	ДанныеИнфекции = ПолучитьСтруктуруДанныхИнфекций();
	ДанныеИнфекции.ВходитВНациональныйКалендарь = Истина;
	
	ДанныеИнфекции.МесяцаВакцинаций.Добавить(3);
	ДанныеИнфекции.МесяцаВакцинаций.Добавить(4.2);
	ДанныеИнфекции.МесяцаВакцинаций.Добавить(6);
	ДанныеИнфекции.МесяцаВакцинаций.Добавить(18);
	
	ДанныеИнфекции.Вакцины.Добавить(Справочники.Вакцины.ИнфанриксГекса);
	ДанныеИнфекции.Вакцины.Добавить(Справочники.Вакцины.Пентаксим);
	
	СписокИнфекций.Вставить(Справочники.Инфекции.Коклюш, ДанныеИнфекции);
	
	#КонецОбласти
	
	#Область Корь
	
	ДанныеИнфекции = ПолучитьСтруктуруДанныхИнфекций();
	ДанныеИнфекции.ВходитВНациональныйКалендарь = Истина;
	
	ДанныеИнфекции.МесяцаВакцинаций.Добавить(12);
	ДанныеИнфекции.МесяцаВакцинаций.Добавить(72);
	
	//ДанныеИнфекции.Вакцины.Добавить();
	
	СписокИнфекций.Вставить(Справочники.Инфекции.Корь, ДанныеИнфекции);
	
	#КонецОбласти
	
	#Область Краснуха
	
	ДанныеИнфекции = ПолучитьСтруктуруДанныхИнфекций();
	ДанныеИнфекции.ВходитВНациональныйКалендарь = Истина;
	
	ДанныеИнфекции.МесяцаВакцинаций.Добавить(12);
	ДанныеИнфекции.МесяцаВакцинаций.Добавить(72);
	
	//ДанныеИнфекции.Вакцины.Добавить();
	
	СписокИнфекций.Вставить(Справочники.Инфекции.Краснуха, ДанныеИнфекции);
	
	#КонецОбласти
	
	#Область ПневмококковаяИнфекция
	
	ДанныеИнфекции = ПолучитьСтруктуруДанныхИнфекций();
	ДанныеИнфекции.ВходитВНациональныйКалендарь = Истина;
	
	ДанныеИнфекции.МесяцаВакцинаций.Добавить(2);
	ДанныеИнфекции.МесяцаВакцинаций.Добавить(4.2);
	ДанныеИнфекции.МесяцаВакцинаций.Добавить(15);
	
	//ДанныеИнфекции.Вакцины.Добавить();
	
	СписокИнфекций.Вставить(Справочники.Инфекции.ПневмококковаяИнфекция, ДанныеИнфекции);
	
	#КонецОбласти
	
	#Область Полиомиелит
	
	ДанныеИнфекции = ПолучитьСтруктуруДанныхИнфекций();
	ДанныеИнфекции.ВходитВНациональныйКалендарь = Истина;
	
	ДанныеИнфекции.МесяцаВакцинаций.Добавить(3);
	ДанныеИнфекции.МесяцаВакцинаций.Добавить(4.2);
	ДанныеИнфекции.МесяцаВакцинаций.Добавить(6);
	ДанныеИнфекции.МесяцаВакцинаций.Добавить(18);
	ДанныеИнфекции.МесяцаВакцинаций.Добавить(20);
	ДанныеИнфекции.МесяцаВакцинаций.Добавить(168);
	
	ДанныеИнфекции.Вакцины.Добавить(Справочники.Вакцины.ИнфанриксГекса);
	ДанныеИнфекции.Вакцины.Добавить(Справочники.Вакцины.Пентаксим);
	
	СписокИнфекций.Вставить(Справочники.Инфекции.Полиомиелит, ДанныеИнфекции);
	
	#КонецОбласти
	
	#Область Столбняк
	
	ДанныеИнфекции = ПолучитьСтруктуруДанныхИнфекций();
	ДанныеИнфекции.ВходитВНациональныйКалендарь = Истина;
	
	ДанныеИнфекции.МесяцаВакцинаций.Добавить(3);
	ДанныеИнфекции.МесяцаВакцинаций.Добавить(4.2);
	ДанныеИнфекции.МесяцаВакцинаций.Добавить(6);
	ДанныеИнфекции.МесяцаВакцинаций.Добавить(18);
	ДанныеИнфекции.МесяцаВакцинаций.Добавить(72);
	ДанныеИнфекции.МесяцаВакцинаций.Добавить(168);
	
	ДанныеИнфекции.Вакцины.Добавить(Справочники.Вакцины.ИнфанриксГекса);
	ДанныеИнфекции.Вакцины.Добавить(Справочники.Вакцины.Пентаксим);
	
	СписокИнфекций.Вставить(Справочники.Инфекции.Столбняк, ДанныеИнфекции);
	
	#КонецОбласти
	
	#Область Туберкулез
	
	ДанныеИнфекции = ПолучитьСтруктуруДанныхИнфекций();
	ДанныеИнфекции.ВходитВНациональныйКалендарь = Истина;
	
	ДанныеИнфекции.МесяцаВакцинаций.Добавить(0);
	ДанныеИнфекции.МесяцаВакцинаций.Добавить(72);
	
	//ДанныеИнфекции.Вакцины.Добавить();
	
	СписокИнфекций.Вставить(Справочники.Инфекции.Туберкулез, ДанныеИнфекции);
	
	#КонецОбласти
	
	#Область ЭпидемическийПаротит
	
	ДанныеИнфекции = ПолучитьСтруктуруДанныхИнфекций();
	ДанныеИнфекции.ВходитВНациональныйКалендарь = Истина;
	
	ДанныеИнфекции.МесяцаВакцинаций.Добавить(12);
	ДанныеИнфекции.МесяцаВакцинаций.Добавить(72);
	
	//ДанныеИнфекции.Вакцины.Добавить();
	
	СписокИнфекций.Вставить(Справочники.Инфекции.ЭпидемическийПаротит, ДанныеИнфекции);
	
	#КонецОбласти
	
	Возврат СписокИнфекций;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыФункции

Функция ПолучитьСтруктуруДанныхИнфекций()
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("ВходитВНациональныйКалендарь", Ложь);
	СтруктураДанных.Вставить("НаличиеВГруппеРиска", Перечисления.ТипыИнфекцияПоВхождениюВГруппыРиска.НеВходитВГруппуРиска);
	СтруктураДанных.Вставить("МесяцаВакцинаций", Новый Массив);
	СтруктураДанных.Вставить("МесяцаВакцинацийДляЛицИзГруппРиска", Новый Массив);
	СтруктураДанных.Вставить("Вакцины", Новый Массив);
	
	Возврат СтруктураДанных; 
	
КонецФункции

#КонецОбласти
